package com.geetion.puputuan.common.enums;

public enum ResultCode {
    CODE_200(200, "访问成功"),
    CODE_401(401, "网络异常，请稍后再试"),

    CODE_403(403, "Method使用错误，请查看API"),
    CODE_404(404, "找不到访问地址"),
    CODE_406(406, "没有权限访问"),
    CODE_500(500, "网络异常，请稍后再试"),
    CODE_501(501, "对象已存在，请检测唯一性"),
    CODE_502(502, "当前版本与服务器版本不一致,请更新应用"),

    //环信相关错误
    CODE_600(600, "网络异常，请稍后重试"),

    //图片相关错误
    CODE_650(650, "上传照片过多,请重新选择上传"),
    CODE_651(651, "删除失败,用户最少需要一张照片"),

    //用户验证
    CODE_700(700, "用户名或密码错误，请重新输入"),
    CODE_701(701, "密码错误"),
    CODE_702(702, "手机号已注册"),
    CODE_703(703, "服务器验证异常，请稍后重新登录"),
    CODE_704(704, "用户未进行账号绑定"),
    CODE_705(705, "用户余额不足，无法提现"),
    CODE_706(706, "该账户已被冻结，请联系蒲蒲团"),
    CODE_707(707, "离上一次更新邀请码不足30天"),
    CODE_708(708, "用户信息存在错误，请检查后重新输入"),
    CODE_710(710, "登陆次数过多，请30秒后再登陆"),
    CODE_711(711, "手机号未注册"),
    CODE_712(712, "你们已经是好友了，请勿重复添加"),
    CODE_713(713, "你已进行过该操作"),
    CODE_714(714, "请登录你的微信号"),
    CODE_715(715, "好友请求已过期"),
    CODE_716(716, "用户已存在"),
    CODE_717(717, "该微信号已被绑定"),
    CODE_718(718, "该手机号已被绑定"),
    CODE_719(719, "用户不存在"),
    CODE_720(720, "该用户已被冻结"),
    CODE_721(721, "该用户资料异常，无法查看相关信息"),
    CODE_722(722, "输入的ID或手机号码不存在"),

    //验证码接口
    CODE_801(801, "调用异常，请重新获取"),
    CODE_802(802, "验证码错误"),
    CODE_803(803, "验证码已失效，请重新获取"),
    CODE_804(804, "您的手机号今天获取短信已经超过10个，请明天再试"),
    CODE_805(805, "短信发送失败，请稍后再试"),

    //团队
    CODE_900(900, "您已在队伍中，请退出当前队伍再重试"),
    CODE_901(901, "您所邀请的好友都在其他队聊中"),
    CODE_902(902, "最多仅能邀请3名队友"),
    CODE_903(903, "抱歉，仅队长才可以进行该项操作"),
    CODE_904(904, "队伍已解散"),
    CODE_905(905, "您没有被邀请过加入该群"),
    CODE_906(906, "该群不在创建流程，无法加入"),
    CODE_907(907, "无该推荐队伍，请重试"),
    CODE_908(908, "当前无进行中的约会"),
    CODE_909(909, "正在匹配中，无法进行该操作"),
    CODE_910(910, "该成员已离开队伍"),
    CODE_911(911, "正在约会流程，无法移除队员"),
    CODE_912(912, "请先完善群信息"),
    CODE_913(913, "当前不在匹配中"),
    CODE_914(914, "群成员少于两个，无法进行匹配"),
    CODE_915(915, "无此评价列表"),
    CODE_916(916, "签到失败，不在指定地点内"),
    CODE_917(917, "队长无法退出团队"),
    CODE_918(918, "您已经被踢出队伍"),
    CODE_919(919, "更新队伍信息成功"),
    CODE_920(920, "每天只能 SuperLike "),
    CODE_921(921, "队伍省、市信息不一致，请解散队伍，重新组队！"),
    CODE_922(922, "您已被管理员列入黑名单，无法进行组队！"),
    CODE_923(923, "所邀请好友已被管理员列入黑名单，无法进行组队！"),


    CODE_1001(1001, "您与他们已经在约会中")
    ;

    public int code;
    public String msg;

    ResultCode(int code, String msg) {
        this.msg = msg;
        this.code = code;
    }

}
